#include<iostream>//必要
using namespace std;//必要

#define b "宏常量"//注意了，这里不是用等号
//define的使用方法为 #define 常量名 常量值
#define c 123

int main()//必要
{
	/*第1节 输出hello world*/
	cout << "Hello,World!\n" << endl;
	//输出"hello world"文本，\n代表换行符
	//——————————

	/*第2节 初次接触变量与定义整数型变量*/
	int a = 666;//创建一个变量a，赋值为666
	cout << "a = " << a << "\n" << endl;//输出变量a
	a = 999;//变量可以再次修改，常量不可以（见第三节）
	cout << "a = " << a << "\n" << endl;//输出变量a
	//——————————

	/*第3节 常量*/
	cout << "常量b：" << b << "  常量c：" << c << "\n" << endl;//输出常量b和c（b、c来源见4、5行）
	//b="出错代码"//常量不可修改

	const int d = 99;
	cout << "常量d：" << d << "\n" << endl;
	//const为修饰的变量
	//使用方法为 const 数据类型 变量名 变量值
	//与上文单纯的int不同的是，加了个const
	//变量就不可修改（下面代码是错误的）
	//d=0
	//——————————

	/*第5节 了解变量的基本常识*/
	//变量的名字必须以下划线_和字母开头
	//数字、汉字都不能作为开头

	//short短整数，占用空间2字节，范围-32768～32767
	//int整数，占4字节
	//long长整数，win4字节，Linux32为4字节，64位8字节
	//longlong长长整数，8字节

	cout << "整数型所占内存空间：" << sizeof(int) << "\n" << endl;
	//sizeof用于取变量所占空间
	//用法 sizeof(数据类型/变量)
	//——————————

	/*第6节 浮点数与双浮点数*/
	//其实我更习惯叫做单浮点和双浮点（双精度小数）
	float f1 = 2.423f;//一般后面加一个f，代表它是一个浮点数，如果你把鼠标移到数字上面的话他会显示(float)2.423000097F
	//float f2 = 2.423;//如果不加f的话，把鼠标移到数字上面的话他会显示(double)2.423000000000000043；同样，VS错误列表也会显示警告
	cout << "f1数值：" << f1 << "\n" << endl;
	double d1 = 41.1542524;
	cout << "f2数值：" << d1 << "\n" << endl;
	//浮点数占用空间4字节
	//双浮点数占用空间8字节

	/*第7节 字符型*/
	//其实我更习惯叫做字节型，因为它只占用1字节
	char c1 = 'a';//这里只能使用单引号
	//char c1 = "a";//否则会报错
	//char c1 = 'abc';//上文说到只有1字节，所以说文本长度只能是1，否则会出现一大堆乱七八糟的错误和警告
	cout << "a对应的ASCII编码：" << (int)c1 << "\n" << endl;//如果你想知道字母a对应的ASCII编码的话可以将其转换成数字

	/*第8节 字符串*/
	//其实我更习惯叫做文本型
	/*1 C语言风格*/
	char t1[] = "hello world(C)";
	cout << t1 << "\n" << endl;
	/*2 C++风格*/
	string t2 = "hello world(C++)";
	cout << t2 << "\n" << endl;

	/*第9节 布尔类型*/
	//其实我更喜欢叫做逻辑型
	bool flag = true;//真
	cout << "真：" << flag << "\n" << endl;//输出1
	flag = false;//假
	cout << "假：" << flag << "\n" << endl;//输出0
	//由输出结果易猜测，bool占1字节
	cout << "逻辑型所占空间：" << sizeof(flag) << "\n" << endl;

	/*第10节 基础运算*/
	//也就加减乘除，只是多了个取余数而已，可以稍微看下跳过
	cout << "1 + 2 = " << 1 + 2 << "\n" << endl;//加
	cout << "1 - 2 = " << 1 - 2 << "\n" << endl;//减
	cout << "1 * 2 = " << 1 * 2 << "\n" << endl;//乘
	cout << "1 / 2 = " << 1 / 2 << "\n" << endl;//除
	cout << "5 % 2 = " << 5 % 2 << "\n" << endl;//5÷2=2···1
	
	//system("pause");
	//B站上面的教程有这串命令
	//不过我不知道是什么用途

	return 0;//必要
}

//前10节的教程到此结束，你掌握了多少呢？来群里告诉大家吧！
